[
  {
    "Date": "2026-01-20 15:43:33",
    "ShareLink": "https://www.linkedin.com/feed/update/urn%3Ali%3Ashare%3A7419404228005109760",
    "ShareCommentary": "With Claude Code, I can dream up tools that closely match my workflow and environment, and conjure them into existence. So far, Claude Code and friends are the closest thing to a “thought compiler” that humanity has produced. Every time I open my laptop and fire up an AI coding agent, I'm on the edge of my seat leaning forward in amazement, with a feeling I haven’t had since playing Wolfenstein 3D for the first time in 1992 (a game that helped popularize the FPS genre). \"\n\"\"\n\"With that kind of power on tap, I often run into this question: do I adopt an existing framework and its opinionated abstractions, or build the tool I actually want? There are many trade-offs to consider.\"\n\"\"\n\"I chose \"build my own\" for a recent experiment - a simplistic microblogging tool. I'm pleased so far, but how long will it stay simplistic? When will I decide that a tool like Jekyll, Hugo, or Gatsby is a better choice?\"\n\"\"\n\"https://lnkd.in/ePrtt3nZ",
    "SharedUrl": "https://github.com/sujankapadia/monolog",
    "MediaUrl": "",
    "Visibility": "MEMBER_NETWORK"
  },
  {
    "Date": "2026-01-16 15:58:05",
    "ShareLink": "https://www.linkedin.com/feed/update/urn%3Ali%3AugcPost%3A7417958332063449088",
    "ShareCommentary": "Context, memory, and iterative development are critical for scaling up development with AI coding agents. Connecting them to issue trackers (JIRA, Github Issues), MCP servers like Context7 (for API/SDK documentation), Playwright (for feedback on how the UI behaves), observability data (OpenTelemetry/Jaeger, Sentry, Honeycomb) and providing documentation and templates on patterns and example implementations, can be a game changer.",
    "SharedUrl": "",
    "MediaUrl": "",
    "Visibility": "MEMBER_NETWORK"
  },
  {
    "Date": "2026-01-06 16:16:16",
    "ShareLink": "https://www.linkedin.com/feed/update/urn%3Ali%3AugcPost%3A7414339029665783809",
    "ShareCommentary": "I recently hit a couple security/safety issues with Claude Code.  Click on my article for a couple examples and mitigation techniques.\"\n\"\"\n\"Please remember there is no guarantee that instructions in your context or CLAUDE.MD will be followed.\"\n\"\"\n\"#AI #Security #PromptsAreNotGuardrails #ClaudeCode #AIAgents",
    "SharedUrl": "",
    "MediaUrl": "",
    "Visibility": "MEMBER_NETWORK"
  },
  {
    "Date": "2025-12-31 20:04:13",
    "ShareLink": "https://www.linkedin.com/feed/update/urn%3Ali%3Ashare%3A7412222066898178048",
    "ShareCommentary": "In 2025, I've spent more time than ever conversing with AI coding agents, particularly Claude Code. These conversations are an intimate look into how we think and solve problems. Every chat with the agent contains valuable solutions, patterns, decisions, and mistakes. So being able to search, analyze, and learn from those interactions isn't just convenient, it's becoming essential.\"\n\"\"\n\"To help me do this, I built a tool to process Claude Code conversations:\"\n\"\"\n\"https://lnkd.in/eeHVyy32\"\n\"\"\n\"* Import and search your entire conversation history across projects\"\n\"* Analyze sessions, choosing from over 300 LLM models, via OpenRouter, to extract insight and patterns (decisions made, error patterns, how you use AI agents)\"\n\"* Share insights as GitHub Gists (as long as the text passes a security scan)\"\n\"* View basic aggregate statistics on Claude Code usage\"\n\"\"\n\"The tool is built with Python, Streamlit, SQLite with FTS5, OpenRouter, and Gitleaks.\"\n\"\"\n\"I made this for myself, and sharing it in case it helps you too. Once your conversations are in a database, you can start asking questions like “What were the key technical decisions on this project?”, “How did the agent help to research and prototype this feature?”, \"What steps did I take to implement this?\" and “What errors does the agent commonly make?”\"\n\"\"\n\"It’s a work in progress, and I’m planning on adding more features. If you’re curious what your Claude Code sessions may reveal, take it for a spin!\"\n\"\"\n\"#AI #LLM #Agents #AICodingAgents #ClaudeCode #TheMoreYouKnow\"\n\"",
    "SharedUrl": "",
    "MediaUrl": "",
    "Visibility": "MEMBER_NETWORK"
  },
  {
    "Date": "2025-12-09 19:17:34",
    "ShareLink": "https://www.linkedin.com/feed/update/urn%3Ali%3Ashare%3A7404237794350354432",
    "ShareCommentary": "I find the comments posted under any given Polymarket event quite interesting. In fact, so much so, that I use Claude Code + Playwright MCP to process the comments, asking it to: \"Summarize the key points being made for and against, anything that stands out to you as insightful, novel, or on the fringe\".  I did this today for the \"Fed Rate Cut Decision in December\" (https://lnkd.in/erdRyJ27)\"\n\"\"\n\"I need Playwright MCP because the comments are dynamically fetched and rendered (infinite scrolling), so a static HTML fetch is not sufficient. \"\n\"\"\n\"Presumably, people placing bets are motivated to provide good information on there to inform others participating. Based on the summary analysis of the comments, I feel I can learn a lot about the event and relevant details.\"\n\"\"\n\"#predictionmarkets #themoreyouknow #claudecode #ai #polymarket",
    "SharedUrl": "https://polymarket.com/event/fed-decision-in-december?tid=1765303407615",
    "MediaUrl": "",
    "Visibility": "MEMBER_NETWORK"
  },
  {
    "Date": "2025-12-05 18:37:50",
    "ShareLink": "https://www.linkedin.com/feed/update/urn%3Ali%3Ashare%3A7402778244455768064",
    "ShareCommentary": "Google - if you're listening, for NotebookLM, I'd love to see a feature where you can point it to a Gemini Canvas chat to produce content/slide decks from the conversation and vibe-coded app. Build prototype -> fire up NotebookLM -> send presentation to VC firm, voila! (Sure, you can do this now, but it takes more steps).",
    "SharedUrl": "",
    "MediaUrl": "",
    "Visibility": "MEMBER_NETWORK"
  },
  {
    "Date": "2025-12-02 20:50:03",
    "ShareLink": "https://www.linkedin.com/feed/update/urn%3Ali%3AugcPost%3A7401724355656704000",
    "ShareCommentary": "AI can turn your computer into a 3D printer for software. It's a revolutionary shift in how we interface with technology, and I had the opportunity to engage with others in the Philly community by presenting on this last week at Technical.ly's monthly event \"AI and Coffee Chat\".\"\n\"\"\n\"Just like the shift from boxed software to instant downloads changed everything, we're entering an era where creating custom tools can start by having a conversation. Instead of searching the app store or subscribing to another SaaS, you may be able to just build it. \"\n\"\"\n\"Everything starts as a conversation, an experiment, a prototype.\"\n\"\"\n\"Thanks Technical.ly for hosting, and Jaizel Cespedes and everyone who came out and engaged in the discussion!\"\n\"\"\n\" #AI #SoftwareDevelopment #TechnicallyPhilly #CodingAgents #Innovation Chariot Solutions",
    "SharedUrl": "",
    "MediaUrl": "",
    "Visibility": "MEMBER_NETWORK"
  },
  {
    "Date": "2025-12-02 18:51:30",
    "ShareLink": "https://www.linkedin.com/feed/update/urn%3Ali%3Ashare%3A7401694521266315264",
    "ShareCommentary": "Very interesting acquisition by Anthropic.",
    "SharedUrl": "",
    "MediaUrl": "",
    "Visibility": "MEMBER_NETWORK"
  },
  {
    "Date": "2025-12-01 22:39:53",
    "ShareLink": "https://www.linkedin.com/feed/update/urn%3Ali%3Ashare%3A7401389608204128256",
    "ShareCommentary": "Over the holidays, I discovered a great shopping companion when I'm out on my own - ChatGPT voice mode and a pair of earbuds (AirPods in my case). I can load a shopping list beforehand and then talk to ChatGPT to discuss and update the list, ask for reviews on products or find alternatives, or ask it for suggestions on things I may be missing on the list. No one around me really knew I was talking to AI.\"\n\"\"\n\"The best part - it never complains about the parking spot I choose 😜  🤣\"\n\"\"\n\"#shopping #chatgpt #voice #ai",
    "SharedUrl": "",
    "MediaUrl": "",
    "Visibility": "MEMBER_NETWORK"
  },
  {
    "Date": "2025-12-01 14:21:05",
    "ShareLink": "https://www.linkedin.com/feed/update/urn%3Ali%3Ashare%3A7401264079954296832",
    "ShareCommentary": "Claude Code is the textbook definition of \"product-led growth\" (PLG).",
    "SharedUrl": "",
    "MediaUrl": "",
    "Visibility": "MEMBER_NETWORK"
  },
  {
    "Date": "2025-11-19 14:43:40",
    "ShareLink": "https://www.linkedin.com/feed/update/urn%3Ali%3Ashare%3A7396921105673826305",
    "ShareCommentary": "I’ve been attending and participating in more events lately, and it’s been a blast. There’s simply no substitute for live, in-person conversations. It’s refreshing to talk to a real human whose reactions aren’t mediated, filtered, or shaped by an algorithm.\"\n\"\"\n\"AI is an incredible accelerator for productivity and innovation, and we should use it. But we also need to balance our increasing reliance on technology with real-world interaction. The more time we spend online, the more valuable genuine, unstructured human connection becomes.\"\n\"\"\n\"At the same time, it’s still amazing that people across the world can meet virtually, instantly, and share ideas that move things forward. The magic is in using both wisely.\"\n\"\"\n\"#AI #Humanity #InPerson #Virtual #Connections #LiveEvents #ShareYourKnowledge",
    "SharedUrl": "",
    "MediaUrl": "",
    "Visibility": "MEMBER_NETWORK"
  },
  {
    "Date": "2025-11-13 16:23:14",
    "ShareLink": "https://www.linkedin.com/feed/update/urn%3Ali%3Ashare%3A7394771836745502722",
    "ShareCommentary": "Claude is really good at putting together Reveal.js presentations that look nice. Far better than I could by myself. I can focus on the structure and content, and guide it to generate the slides. \"\n\"\"\n\"Taking a step back, if you're working on something and get the feeling that a lot of it is \"busy typing\", stop. See how much of that can be handled by an LLM. It's far faster at typing and searching than you, while you're better at experience, reasoning, and judgement. \"\n\"\"\n\"LLMs really expose the fact that most things are just different \"representations\" or \"projections\" of underlying concepts, information, and data models. The various formats, whether that's a PRD document, source code, SQL, presentation, or image / audio / video, can be generated from the source information. If you really invest time in understanding the domain and curating the source information, you are well positioned to take advantage of AI tools.\"\n\"\"\n\"#AI #LLM #Information #HumanJudgement #Claude",
    "SharedUrl": "",
    "MediaUrl": "",
    "Visibility": "MEMBER_NETWORK"
  },
  {
    "Date": "2025-11-06 16:40:13",
    "ShareLink": "https://www.linkedin.com/feed/update/urn%3Ali%3Ashare%3A7392239394981847040",
    "ShareCommentary": "I have a meeting in Center City tonight, and needed to check SEPTA’s updated late-night schedules. ChatGPT’s built-in web search wasn’t cutting it and I didn't feel like futzing with it more, so I fired up OpenAI's agentic browser, Atlas.\"\n\"\"\n\"It went to SEPTA's website, used the \"Plan Your Trip\" feature, and came back with the right train and times. It took longer than doing it manually, but since I didn’t need the result immediately, I let it run in the background. \"\n\"\"\n\"I don’t trust agentic browsers (prompt injection and exfiltration risk), so I ran it on a separate machine. Still, it’s a good real-world test of how agents can augment a low-priority search task.\"\n\"\"\n\"#AI #Agents #AgenticBrowsers #Search #LLM",
    "SharedUrl": "",
    "MediaUrl": "",
    "Visibility": "MEMBER_NETWORK"
  },
  {
    "Date": "2025-10-24 15:35:59",
    "ShareLink": "https://www.linkedin.com/feed/update/urn%3Ali%3Ashare%3A7387512188875300869",
    "ShareCommentary": "Completely agree with this post from Dave Clark at Auger. “Build forward” nails where product development is headed. With coding agents in the mix, it’s all one continuous loop now.\"\n\"\"\n\"Inputs: text, existing docs, prior code, real user feedback.\"\n\"Outputs: generated code, designs, diagrams, code execution results, prototypes, docs, which all feed right back in as the next inputs.\"\n\"\"\n\"You’re learning and iterating on the product and your understanding at the same time. The document isn’t the primary artifact anymore. The prototype is. What I also find insightful is the conversation history with the agent that shows how you are thinking and collaborating.\"\n\"\"\n\"Post: https://lnkd.in/dv--B8zw",
    "SharedUrl": "",
    "MediaUrl": "",
    "Visibility": "MEMBER_NETWORK"
  },
  {
    "Date": "2025-10-22 14:35:21",
    "ShareLink": "https://www.linkedin.com/feed/update/urn%3Ali%3Ashare%3A7386772153813118978",
    "ShareCommentary": "If your favorite application provides a data export, you can use AI coding agents to accelerate building tools or applications on top of that exported data, potentially getting access to features that normally require a paid upgrade to enable. Ultimately I think this creates a richer ecosystem around the product, and is \"free marketing\" and \"idea generation\" for the application provider.\"\n\"\"\n\"Case in point - I use ASICS Runkeeper to track my runs, and wanted access to heart zones, which is behind their Premium tier. Fortunately, I am able to export my activities, which includes a GPX file per activity. \"\n\"\"\n\"I used Claude Code last week to generate a small Python utility that accepts a GPX file and produces several charts. It uses the following dependencies: pandas, numpy, matplotlib, geopy\"\n\"\"\n\"Heart Rate Over Time with Training Zones\"\n\"- Shows how your heart rate changes throughout the run and how long you spend in each zone.\"\n\"Pace Over Time (Smoothed) from GPS Data\"\n\"- Plots running pace (min/mile) against time using real GPS distance calculations.\"\n\"Pace vs Heart Rate Over Time (Color-Coded by Zone)\"\n\"- Combines pace and effort into one chart — revealing where your heart rate spikes relative to your pace.\"\n\"\"\n\"https://lnkd.in/eDCZaukP",
    "SharedUrl": "",
    "MediaUrl": "",
    "Visibility": "MEMBER_NETWORK"
  },
  {
    "Date": "2025-10-22 02:42:36",
    "ShareLink": "https://www.linkedin.com/feed/update/urn%3Ali%3Ashare%3A7386592783379357696",
    "ShareCommentary": "Very early first impressions of OpenAI's ChatGPT Atlas Browser - specifically, Agent Mode:\"\n\"\"\n\"Disclaimer: I don't plan on using this browser again, because I'm worried about \"prompt injection attacks\", but wanted to try it out once.\"\n\"\"\n\"Task: I asked it to log into ASICS Runkeeper and export my activity (5K run) for today. \"\n\"\"\n\"Performance and behavior:\"\n\"- It’s slow, understandably, since it sends screenshots and HTML to the LLM to interpret the page, then makes one or more attempts to find the right element to click or enter input into. \"\n\"- You can see what it's doing, and what it's \"thinking\", since that is emitted in the chat window. \"\n\"- The agent has access to the LLM's trained knowledge base, and tools (e.g. web searches to gather more information to help complete the task).\"\n\"- You can take over control, hand it back to the agent, or stop it completely.\"\n\"\"\n\"Limitations:\"\n\"- It won’t enter login credentials, so you have to do that manually.\"\n\"- It won’t download files automatically, you have to handle that part yourself.\"\n\"- It may ask for confirmation before taking the next action (e.g., which button to click).\"\n\"\"\n\"Hiccups:\"\n\"- It struggled with clicking the correct position in a pop up date picker, but got it after three tries. It was trying to determine the X position of the 16th (day of October) to click on it.\"\n\"- It made multiple attempts to export the data (re-entering the date range and clicking \"Export\") and missed the “Download Now!” button a few times, but eventually got it. To be fair, the Runkeeper page design doesn’t make this easy.\"\n\"- It can loop a few times, making silly mistakes in finding the right element, before successfully continuing.\"\n\"\"\n\"Memory and persistence:\"\n\"- Information or special instructions on how to interact with the page do not seem to persist beyond the session. Once the chat ends, it forgets.\"\n\"- So, before ending the chat, I asked it to write out instructions I could paste into a prompt later. In a new session, I pasted those same instructions, and it followed them successfully. The instructions seemed to help - I didn't have to intervene at all this time, except for the download (we were already logged in still).\"\n\"\"\n\"#AIBrowsers #Agents #ChatGPT #ChatGPTAtlas",
    "SharedUrl": "",
    "MediaUrl": "",
    "Visibility": "MEMBER_NETWORK"
  },
  {
    "Date": "2025-10-22 00:40:56",
    "ShareLink": "https://www.linkedin.com/feed/update/urn%3Ali%3Ashare%3A7386562169519386624",
    "ShareCommentary": "On my jog today, a toddler in a stroller pointed at me and said “running,” then pointed at a football practice session and said \"football\". His grandmother responded with \"Yes, good job\". Babies are machine learning models in training—labeling data and running real-time evals on the world. 🤣 \"\n\"\"\n\"#Babies #MachineLearning #ReinforcementLearning",
    "SharedUrl": "",
    "MediaUrl": "",
    "Visibility": "MEMBER_NETWORK"
  },
  {
    "Date": "2025-10-21 15:38:07",
    "ShareLink": "https://www.linkedin.com/feed/update/urn%3Ali%3Ashare%3A7386425564905086976",
    "ShareCommentary": "In case you missed Chariot Solutions' panel discussion last week on AI - \"What Does it Mean to Be a Developer in the Age of AI Agents?\" - it's available to watch right now! This was a really engaging and fun discussion to be part of. It's great to see engineers and leaders in the Philly area getting together to talk about AI and it's impact on the engineering and product teams.\"\n\"\"\n\"https://lnkd.in/eiVUNAiH\"\n\"\"\n\"#AI #AIAgents #CodingAgents #LLM #FutureOfWork\"\n\"",
    "SharedUrl": "",
    "MediaUrl": "",
    "Visibility": "MEMBER_NETWORK"
  },
  {
    "Date": "2025-10-17 17:32:52",
    "ShareLink": "https://www.linkedin.com/feed/update/urn%3Ali%3Ashare%3A7385004886700011521",
    "ShareCommentary": "At our recent Chariot Solutions panel discussion in Radnor, PA, we dove into how AI agents are shifting the developer role—moving from autocomplete helpers to full-fledged collaborators in the software lifecycle. We touched on new bottlenecks in process, the challenges around security and governance, and how teams should evolve in mindset and structure.\"\n\"\"\n\"Read it here: https://lnkd.in/e_kr5p_e\"\n\"\"\n\"I'd love to know your thoughts - have you already started using AI agents in your development and business workflows?\"\n\"\"\n\"Thanks to Joel Confino, Brian O'Neill, Grace Francisco, and Tracey Welson-Rossman for helping to make it a great event!\"\n\"\"\n\"#AI #DeveloperTools #AIAgents #LLM #FutureOfWork #ChariotSolutions",
    "SharedUrl": "http://chariotsolutions.com/blog/post/event-recap-what-does-it-mean-to-be-a-developer-in-the-age-of-ai-agents/",
    "MediaUrl": "",
    "Visibility": "MEMBER_NETWORK"
  },
  {
    "Date": "2025-10-17 14:07:07",
    "ShareLink": "https://www.linkedin.com/feed/update/urn%3Ali%3Ashare%3A7384953112370810880",
    "ShareCommentary": "If you need a token counter utility that works across OpenAI, Anthropic (Claude), and Google (Gemini) models, check out this simple Python CLI tool I built with Claude Code - https://lnkd.in/ep2iBmeX. It returns token count via provider SDKs, and estimated cost (using the genai-prices library, non-cached input tokens only). \"\n\"\"\n\"For Anthropic and Gemini, you need API keys because it calls out to their APIs. OpenAI is fully offline, using the tiktoken library.\"\n\"\"\n\"#AI #LLM #OpenSource #Python #DevTools #OpenAI #Claude #Gemini",
    "SharedUrl": "https://github.com/sujankapadia/token-counter",
    "MediaUrl": "",
    "Visibility": "MEMBER_NETWORK"
  },
  {
    "Date": "2025-10-17 13:12:25",
    "ShareLink": "https://www.linkedin.com/feed/update/urn%3Ali%3Ashare%3A7384939345755029504",
    "ShareCommentary": "With Claude Plugins, and now Skills, Anthropic is expanding Claude Code's grip on the development workflow. The more we customize our environments to work with Claude Code, the more locked in we become. It's a smart strategy by Anthropic, and they're executing well. Other coding agents will follow the same playbook. We're heading into a new 'IDE wars' era 🙂 \"\n\"",
    "SharedUrl": "",
    "MediaUrl": "",
    "Visibility": "MEMBER_NETWORK"
  },
  {
    "Date": "2025-10-06 20:58:51",
    "ShareLink": "https://www.linkedin.com/feed/update/urn%3Ali%3Ashare%3A7381070462040084481",
    "ShareCommentary": "Here's what one of Chariot Solutions clients, Delaware North, has to say about our collaboration with them  - \"Chariot Solutions has empowered us with immediate, actionable insights into our data. With daily visibility into customer activity and business transactions, we always know exactly where our business stands. This allows us to quickly identify and address areas of concern, and to create personalized offers for our customers based on their most recent activity.\"\"\n\"\"\n\"#DataEngineering #GamingTech #AWS #Databricks",
    "SharedUrl": "",
    "MediaUrl": "",
    "Visibility": "MEMBER_NETWORK"
  },
  {
    "Date": "2025-09-29 14:21:13",
    "ShareLink": "https://www.linkedin.com/feed/update/urn%3Ali%3Ashare%3A7378433676189270016",
    "ShareCommentary": "AI coding agents and IDE-integrated assistants are reshaping how we build software.  Will AI replace certain types of engineering work, will it elevate our craft to new levels of creativity and strategic thinking, or will we drown in a sea of technical debt?\"\n\"\"\n\"Join us on October 15th in Radnor, PA for a panel discussion with Joel Confino, Sujan Kapadia, and Brian O'Neill, moderated by Grace Francisco, as they explore firsthand experiences and future-forward thinking in this evolving developer landscape.\"\n\"\"\n\"You can register here: https://lnkd.in/ed7GK4jk\"\n\"\"\n\"#AI #CodingAgents #LLM #SoftwareEngineering",
    "SharedUrl": "",
    "MediaUrl": "",
    "Visibility": "MEMBER_NETWORK"
  },
  {
    "Date": "2025-09-28 17:14:03",
    "ShareLink": "https://www.linkedin.com/feed/update/urn%3Ali%3Ashare%3A7378114784682012672",
    "ShareCommentary": "This blog post, by Chris Loy, matches my thoughts on, and approach towards using AI coding agents: https://lnkd.in/eSSugg-4. It's very well written, and the author effectively uses diagrams to get his point across.\"\n\"\"\n\"#CodingAgents #ClaudeCode #AI #SoftwareEngineering #SDLC #TechLeadership",
    "SharedUrl": "https://chrisloy.dev/post/2025/09/28/the-ai-coding-trap",
    "MediaUrl": "",
    "Visibility": "MEMBER_NETWORK"
  },
  {
    "Date": "2025-09-24 16:48:17",
    "ShareLink": "https://www.linkedin.com/feed/update/urn%3Ali%3Ashare%3A7376658746996957184",
    "ShareCommentary": "Excellent post on technical leadership - https://lnkd.in/erhjbPzJ\"\n\"\"\n\"One key aspect of technical leadership is being an effective translator. It's not about being the smartest person in the room.\"\n\"\"\n\"This post talks about how to lead when you're surrounded by experts who know more than you about their domains. Your value lies in connecting the dots, asking the right questions, and bridging the gap between technical complexity and business goals. Worth a read for any technical leader.\"\n\"\"\n\"#TechLeadership #Communication",
    "SharedUrl": "https://idiallo.com/blog/how-to-lead-in-a-room-full-of-experts",
    "MediaUrl": "",
    "Visibility": "MEMBER_NETWORK"
  },
  {
    "Date": "2025-09-11 13:46:07",
    "ShareLink": "https://www.linkedin.com/feed/update/urn%3Ali%3Ashare%3A7371901863128113152",
    "ShareCommentary": "Natural language interfaces promise speed and flexibility — but at what cost? A blank chat box may look simple, but is it usable? In Part 3 of my “Adding Conversational AI to Your App” series at Chariot Solutions, I explore what we gain, what we lose, and how to bridge the gap when designing chat-based apps vs traditional GUIs.\"\n\"\"\n\"https://lnkd.in/e_zcBYzA\"\n\"\"\n\"#UX #design #chatbot #AI #LLM",
    "SharedUrl": "https://chariotsolutions.com/blog/post/adding-conversational-ai-to-your-app-part-3-the-ux-of-chat-interfaces-what-we-gain-and-lose/",
    "MediaUrl": "",
    "Visibility": "MEMBER_NETWORK"
  },
  {
    "Date": "2025-09-08 16:13:06",
    "ShareLink": "https://www.linkedin.com/feed/update/urn%3Ali%3Ashare%3A7370851688720547840",
    "ShareCommentary": "My first experience with Coderabbit.ai (14 day free trial of Pro plan) - AI code reviews - is positive. I suggest giving it a spin on a *public* repo. \"\n\"\"\n\"* Good suggestions, and minimal noise so far (Typescript/Node/AWS codebase)\"\n\"* Attempts to cover logic, performance, security, cloud configuration, and documentation.\"\n\"* Produces patches and \"Prompt for AI agents\" for each issue, instructing how to fix.\"\n\"* Includes \"Nitpick comments\" - minor but valuable suggestions.\"\n\"* Works within IDEs (like Cursor), and runs on each pull request.\"\n\"* Produces sequence diagrams in PRs (that was a nice surprise).\"\n\"\"\n\"Here's a sample of some of the issues it found:\"\n\"\"\n\"It found an O(N^2) issue and suggested limiting N to prevent an unbounded problem. \"\n\"\"\n\"It suggested replacing node-fetch with global fetch (being a very infrequent Node and Typescript developer, I wasn't even aware of this).\"\n\"\"\n\"Add runtime payload validation for XYZ. Defensive checks prevent hard-to-debug crashes when the public Lambda (or tests) sends malformed payloads.\"\n\"\"\n\"Adds this (among other items) to the TODO.md: Enable provisioned concurrency for the public Lambda path\"\n\"\"\n\"Store secrets in AWS Secrets Manager with rotation; prefer IAM auth for Postgres (I should configure rotation since I use Secrets Manager, but IAM auth would be better).\"\n\"\"\n\"Don’t inject Slack secrets into the private Lambda. Private Lambda doesn’t use Slack; passing these via CDK env risks accidental secret leakage (e.g., deploy-time env set on the operator’s shell). Remove them from environment.\"\n\"\"\n\"#AI #CodeReview #CodeRabbitAI",
    "SharedUrl": "",
    "MediaUrl": "",
    "Visibility": "MEMBER_NETWORK"
  },
  {
    "Date": "2025-09-05 17:11:30",
    "ShareLink": "https://www.linkedin.com/feed/update/urn%3Ali%3Ashare%3A7369779219746156544",
    "ShareCommentary": "Whether you're an engineer, or a manager that has stepped away from coding on a daily basis, there's never been a better time to work on an idea or side project.\"\n\"\"\n\"With AI coding agents, keeping up with modern tools and practices is not just possible, it’s faster, easier, and more rewarding than ever.\"\n\"\"\n\"I recently spun up a serverless architecture on AWS: API Gateway, Lambda, RDS, Secrets Manager, VPC endpoints, and Amazon Bedrock powering a Slackbot. With Claude Code's help, I built the project using Node, TypeScript, Slack Bolt, CDK, and GitHub Actions. Four days, including learning, research, and some refactoring.\"\n\"\"\n\"There’s no way I could go back to doing development the old way. These tools collapse barriers: they shorten the learning curve, multiply output, and make it possible to move from idea to prototype at a faster pace.\"\n\"\"\n\"Now I have a living project to learn from and refine (it certainly needs it): reviewing the code and scripts, refactoring, and applying best practices as I pick up insights from human experts, blog posts, and agents.\"\n\"\"\n\"But speed isn’t the whole story. Good output requires experience, judgment, small iterations, testing, and constant vigilance. The agent gets you moving fast—but it’s your craft that keeps things on track. (We all know how many mistakes and wrong turns the LLM driven agents can make.)\"\n\"\"\n\"The opportunity is huge. Fluency with these tools won’t just be an advantage, it will be table stakes.\"\n\"\"\n\"Here's the public repo if you'd like to explore - https://lnkd.in/ehXnDiep\"\n\"\"\n\"#ClaudeCode #AICoding #FutureOfWork #AWS",
    "SharedUrl": "",
    "MediaUrl": "",
    "Visibility": "MEMBER_NETWORK"
  },
  {
    "Date": "2025-08-29 12:56:27",
    "ShareLink": "https://www.linkedin.com/feed/update/urn%3Ali%3Ashare%3A7367178322042167297",
    "ShareCommentary": "Anthropic just updated their \"Consumer Terms of Service\" - apparently they will train their models with user data going forward. \"\n\"\"\n\"To continue using Claude, you'll need opt IN or OUT by 9/28. For those who opt IN, data retention is being increased from 30 days to 5 years! \"\n\"\"\n\"Existing users can opt out by going to Claude's Settings, selecting the Privacy option, and toggling off \"Help improve Claude.\"\"\n\"\"\n\"Consumer Terms of Service - https://lnkd.in/eBYCp4dN\"\n\"\"\n\"#ai #llm #data #privacy #security",
    "SharedUrl": "",
    "MediaUrl": "",
    "Visibility": "MEMBER_NETWORK"
  },
  {
    "Date": "2025-08-26 15:41:58",
    "ShareLink": "https://www.linkedin.com/feed/update/urn%3Ali%3Ashare%3A7366132809511485440",
    "ShareCommentary": "In Part 2 of my new, beginner-friendly series \"Adding Conversational AI to Your App\", I break down how to add conversation history to the system prompt in order to make the app feel natural and context-aware—using OpenAI, TypeScript, and Node, no frameworks required! Chariot Solutions\"\n\"\"\n\"https://lnkd.in/eMf7Pidf\"\n\"\"\n\"#ConversationalAI  #OpenAI #LLM #AIEngineering #TypeScript #NodeJS #ClaudeCode\"\n\"",
    "SharedUrl": "",
    "MediaUrl": "",
    "Visibility": "MEMBER_NETWORK"
  },
  {
    "Date": "2025-08-15 13:40:48",
    "ShareLink": "https://www.linkedin.com/feed/update/urn%3Ali%3Ashare%3A7362116051062456322",
    "ShareCommentary": "In Part 1 of my new, beginner-friendly series \"Adding Conversational AI to Your App\", I break down how to map natural-language input into structured JSON your app can work with—using OpenAI, TypeScript, and Node, no frameworks required! Chariot Solutions\"\n\"\"\n\"https://lnkd.in/ezwUPUHy\"\n\"\"\n\"#ConversationalAI #OpenAI #LLM #AIEngineering #TypeScript #NodeJS #ClaudeCode",
    "SharedUrl": "",
    "MediaUrl": "",
    "Visibility": "MEMBER_NETWORK"
  },
  {
    "Date": "2025-08-11 19:07:01",
    "ShareLink": "https://www.linkedin.com/feed/update/urn%3Ali%3AugcPost%3A7360748596884819969",
    "ShareCommentary": "I’m happy to share that I’m starting a new position as Chief AI Officer at Chariot Solutions, one of the most exciting roles of my career. \"\n\"\"\n\"AI is transforming the way we build, think, and work. In this role, I’ll be leading our AI strategy and execution, internally and externally - exploring where emerging technologies can responsibly and meaningfully impact our clients’ products, processes, and teams.\"\n\"\"\n\"If you’re exploring how to leverage AI—whether it’s product innovation, workflow automation, or enhancing your engineering teams—let’s connect. I’m always up for a conversation about what’s possible and how to make it real.\"\n\"\"\n\"I’m so grateful to my colleagues at Chariot for trusting me to help shape this vision.",
    "SharedUrl": "",
    "MediaUrl": "",
    "Visibility": "MEMBER_NETWORK"
  },
  {
    "Date": "2025-07-28 21:44:14",
    "ShareLink": "https://www.linkedin.com/feed/update/urn%3Ali%3Ashare%3A7355714731845771264",
    "ShareCommentary": "Claude Code's way of telling me to take a break and go touch grass:\"\n\"\"Claude usage limit reached. Your limit will reset at 7pm (America/New_York).\"\"\n\"\"\n\"To make matters worse, when I go to claude.ai online, I get \"Usage limit reached — your limit will reset at 7:00 PM. Your limits are shared with Claude Code\"",
    "SharedUrl": "",
    "MediaUrl": "",
    "Visibility": "MEMBER_NETWORK"
  },
  {
    "Date": "2025-07-24 16:03:31",
    "ShareLink": "https://www.linkedin.com/feed/update/urn%3Ali%3Ashare%3A7354179434544873472",
    "ShareCommentary": "While in Claude Code, I needed to check on the availability of a domain name. It's nice I don't have to leave the session to do this. The growing number of tasks you can accomplish within a single interface, is pretty amazing. Now I just need to create an MCP server for DoorDash/UberEats so I can check menus and order food while coding with Claude :) \"\n\"\"\n\"------Conversation------\"\n\"Please check if the domain name iterativeai.com is available.\"\n\"\"\n\"⏺ I'll check if the domain name iterativeai.com is available for you.\"\n\"\"\n\"⏺ Web Search(\"iterativeai.com domain availability check whois\")\"\n\" ⎿ Did 1 search in 16s\"\n\"\"\n\"⏺ Let me check the actual availability of iterativeai.com using a WHOIS lookup tool.\"\n\"\"\n\"⏺ Fetch(https://lnkd.in/dk-a3CEy)\"\n\" ⎿ Received 46.5KB (200 OK)\"\n\"\"\n\"⏺ The domain iterativeai.com is not available - it's already registered.\"\n\"\"\n\" Registration Details:\"\n\" - Status: Registered (not available)\"\n\" - Registered: March 6, 2018\"\n\" - Expires: March 5, 2026\"\n\" - Registrar: EuroDNS S.A.\"\n\" - Location: San Francisco, US\"\n\"\"\n\" The domain is currently in use and protected from transfers.",
    "SharedUrl": "",
    "MediaUrl": "",
    "Visibility": "MEMBER_NETWORK"
  },
  {
    "Date": "2025-07-23 21:05:38",
    "ShareLink": "https://www.linkedin.com/feed/update/urn%3Ali%3Ashare%3A7353893076425154561",
    "ShareCommentary": "My new benchmark for evaluating software documentation: How easily a coding agent (like Claude Code) can consume your SDK or API documentation to produce correct code on the first attempt (or after just a few). If it can do this, you've probably written very thorough, clear, and well structured documentation. \"\n\"\"\n\"Humans aren't the only consumers of software documentation. 😉 \"\n\"\"\n\"#agent #claudecode #genai #documentation",
    "SharedUrl": "",
    "MediaUrl": "",
    "Visibility": "MEMBER_NETWORK"
  },
  {
    "Date": "2025-06-04 14:58:50",
    "ShareLink": "https://www.linkedin.com/feed/update/urn%3Ali%3Ashare%3A7336043763888205833",
    "ShareCommentary": "If I have to reply to your email with a special phrase or word in order for you to stop spamming me, you'll be marked as spam and blocked, whether or not you are a legitimate service (which 95% of them are not). \"\n\"\"\n\"If you keep sending me emails, and then ask me \"hey if you want me to go away, please jump through so and so hoop\", same thing.\"\n\"\"\n\"I need to build an AI agent that automatically responds back with very detailed rejections that start off sounding like real responses. It can also take my facial expression into account (via the cam on my laptop or phone) to modify the tone of the message. 🤣",
    "SharedUrl": "",
    "MediaUrl": "",
    "Visibility": "MEMBER_NETWORK"
  },
  {
    "Date": "2025-05-14 13:53:39",
    "ShareLink": "https://www.linkedin.com/feed/update/urn%3Ali%3Ashare%3A7328417213244203008",
    "ShareCommentary": "From well over a year ago, and I still agree wholeheartedly:\"\n\"\"\n\"Generative AI is a useful tool for converting information into different formats (LaTeX, PDFs, HTML based slides or flashcards, charts).\"\n\"\"\n\"It’s insanely fun to play around with LLMs. It’s wild that I can do all this from a picture of my daughter’s 6th grade math homework!\"\n\"",
    "SharedUrl": "https://medium.com/p/how-to-use-chatgpt-vision-to-generate-math-homework-from-photos-of-my-daughters-assignments-part-1e92509de44d?source=social.linkedin&_nonce=4ZJ7o8wJ",
    "MediaUrl": "",
    "Visibility": "MEMBER_NETWORK"
  },
  {
    "Date": "2025-05-14 13:00:37",
    "ShareLink": "https://www.linkedin.com/feed/update/urn%3Ali%3Ashare%3A7328403867786768384",
    "ShareCommentary": "I am attending the Agentic AI Conference by Data Science Dojo on May 27 and 28, 2025.\"\n\" \"\n\"The conference speakers include thought leaders in industry who will talk about all aspects of building agentic AI applications - covering everything from cutting-edge agentic frameworks to retrieval systems, observability, and guardrails for safe, trustworthy AI.\"\n\" \"\n\"Here are some of the sessions:\"\n\"\"\n\"- Transforming Knowledge Work with AI\"\n\"↳ AI Teammates and the Future of Human-AI Collaboration\"\n\"\"\n\"- Inside the Mind of an AI Agent\"\n\"↳ Agentic Frameworks, Planning, Memory and Tools\"\n\"\"\n\"- From Recall to Context-Aware Reasoning\"\n\"↳ Architecting Retrieval Systems for Agentic AI\"\n\"\"\n\"- Designing Trustworthy Agents\"\n\"↳ Observability, Guardrails and Evaluation in Agentic Systems\"\n\" \"\n\"Get direct access to top industry experts, join live Q&A sessions, and explore the next wave of AI — from anywhere in the world.\"\n\" \"\n\"Join me and thousands of others who will be attending the conference: https://hubs.la/Q03jkdPY0\"\n\" \"\n\"#futureofdataandai #datasciencedojo #agenticai\"\n\"",
    "SharedUrl": "",
    "MediaUrl": "",
    "Visibility": "MEMBER_NETWORK"
  },
  {
    "Date": "2025-05-09 16:05:27",
    "ShareLink": "https://www.linkedin.com/feed/update/urn%3Ali%3Ashare%3A7326638444527443969",
    "ShareCommentary": "I keep seeing people spend extra time on tasks that could be dramatically accelerated with generative AI. Once you realize how much faster and better things can be with just a small change to your workflow — like chatting with an LLM — it’s hard to unsee it.\"\n\"\"\n\"That shift doesn’t require a complete overhaul. Just curiosity, a willingness to experiment, and an openness to iterate until the output clicks. It doesn't replace hard-earned experience, but amplifies it.\"\n\"\"\n\"If you’re a leader, create space for this. Encourage your teams to explore, share what works, and learn together. The biggest AI unlock isn’t technical — it’s cultural.\"\n\"\"\n\"#AI #LLM #WorkSmarter #Productivity #FutureOfWork",
    "SharedUrl": "",
    "MediaUrl": "",
    "Visibility": "MEMBER_NETWORK"
  },
  {
    "Date": "2025-04-04 13:12:53",
    "ShareLink": "https://www.linkedin.com/feed/update/urn%3Ali%3Ashare%3A7313911439210041344",
    "ShareCommentary": "In the rush to build MCP servers, very few are thinking appropriately about security. The ability to maliciously instruct an \"agent\" via natural language is a whole new attack vector. In fact, it'd be interesting to see if these vulnerabilities exist with online chatbots and automated voice assistants over the phone.\"\n\"\"\n\"Every tool should adhere to the \"principle of least privilege\". If you have a very special use case requiring higher privilege access in certain cases, design accordingly for that. You may want to build a purpose-built tool instead of an agent in that case.\"\n\"\"\n\"Folks, please use some common sense as well. Based on some of the examples out there, I'm seeing complicated agents being built that could be boiled down to fewer lines of code and traditional if/else conditional checks. \"\n\" \"\n\"https://lnkd.in/g-T-WBej\"\n\"",
    "SharedUrl": "",
    "MediaUrl": "",
    "Visibility": "MEMBER_NETWORK"
  },
  {
    "Date": "2025-04-02 15:42:39",
    "ShareLink": "https://www.linkedin.com/feed/update/urn%3Ali%3Ashare%3A7313224355029671936",
    "ShareCommentary": "While I have very mixed feelings about the MCP protocol (vs HTTP/REST/Open API and things like GPT actions and plugins), everyone rushing to build half-baked MCP servers, and differing support based on which host you're using (Claude Desktop, Cursor, Cline VSCode plugin, etc.), it does allow you to quickly prototype integrating existing APIs and data sources into LLM applications / agents/ chatbots. \"\n\"\"\n\"If you're in the Java/Spring ecosystem, this is a good blog post by James Ward about running MCP agents on AWS, using Spring AI.\"\n\"\"\n\"https://lnkd.in/eDvq9nuZ\"\n\"\"\n\"I feel the move towards standards is a nice one, but I'm concerned about hallucinations becoming integrated in many more applications. As always, think for yourself -> testing, guardrails, structured outputs and checks, and mostly deterministic \"hand-coded\" workflows with some LLM steps (data extraction, classification, text processing, minimal orchestration)\"\n\"\"\n\"#spring #java #aws #mcp #llm #agents",
    "SharedUrl": "https://community.aws/content/2v8AETAkyvPp9RVKC4YChncaEbs/running-mcp-based-agents-clients-servers-on-aws",
    "MediaUrl": "",
    "Visibility": "MEMBER_NETWORK"
  },
  {
    "Date": "2025-04-02 14:02:03",
    "ShareLink": "https://www.linkedin.com/feed/update/urn%3Ali%3Ashare%3A7313199039078891520",
    "ShareCommentary": "My family and I love doing Mad Libs, so I asked ChatGPT to convert a photo of us in our Eagles gear for the Superbowl into a Mad Libs style cover. It took a few iterations, and ChatGPT is under insanely heavy load so lots of errors and \"try again later\" responses. Not bad, but still couldn't make the googly eyes googly enough.\"\n\"\"\n\"#chatgpt #ai #imagegeneration #madlibs",
    "SharedUrl": "",
    "MediaUrl": "",
    "Visibility": "MEMBER_NETWORK"
  },
  {
    "Date": "2025-03-21 14:17:11",
    "ShareLink": "https://www.linkedin.com/feed/update/urn%3Ali%3Ashare%3A7308854193241358336",
    "ShareCommentary": "Software can now understand natural language and work with unstructured data, opening up major opportunities for innovation, efficiency, and business process automation. Chariot Solutions can help you integrate generative AI into practical, impactful applications for your business — while maintaining data privacy. To start, we can perform an assessment and build you a proof-of-concept - agents, chatbots, hybrid search, content generation, document processing, and more. If you're interested, let's talk!\"\n\"\"\n\"https://lnkd.in/ehKpSxp9\"\n\"\"\n\"#genai #agents #chatbots #RAG #copilots #llm #ai",
    "SharedUrl": "",
    "MediaUrl": "",
    "Visibility": "MEMBER_NETWORK"
  }
]